{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.4", "config": [{"class_name": "BatchNormalization", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "batch_input_shape": [null, 80, 160, 3], "center": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "axis": -1}}, {"class_name": "Conv2D", "config": {"name": "Conv1", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "filters": 60, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "config": {"name": "Conv2", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "filters": 50, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "Conv3", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "filters": 40, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"name": "Conv4", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "filters": 30, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"name": "Conv5", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "filters": 20, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_3"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "Conv6", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "filters": 10, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_4"}}, {"class_name": "Conv2D", "config": {"name": "Conv7", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "filters": 5, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_5"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last"}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "up_sampling2d_1", "size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2DTranspose", "config": {"name": "Deconv1", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "filters": 10, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_6"}}, {"class_name": "Conv2DTranspose", "config": {"name": "Deconv2", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "filters": 20, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_7"}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "up_sampling2d_2", "size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2DTranspose", "config": {"name": "Deconv3", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "filters": 30, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_8"}}, {"class_name": "Conv2DTranspose", "config": {"name": "Deconv4", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "filters": 40, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_9"}}, {"class_name": "Conv2DTranspose", "config": {"name": "Deconv5", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "filters": 50, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_10"}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "up_sampling2d_3", "size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2DTranspose", "config": {"name": "Deconv6", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "filters": 60, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}, {"class_name": "Conv2DTranspose", "config": {"name": "Final", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "filters": 1, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}}]}