{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"name": "batchnormalization_2", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "input_dtype": "float32", "mode": 0, "trainable": true, "beta_regularizer": null, "batch_input_shape": [null, 45, 80, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "activity_regularizer": null, "activation": "linear", "nb_filter": 64, "W_regularizer": null, "nb_col": 3, "trainable": true, "bias": true, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_5", "border_mode": "valid", "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "activity_regularizer": null, "activation": "linear", "nb_filter": 32, "W_regularizer": null, "nb_col": 3, "trainable": true, "bias": true, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_6", "border_mode": "valid", "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "activity_regularizer": null, "activation": "linear", "nb_filter": 16, "W_regularizer": null, "nb_col": 3, "trainable": true, "bias": true, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_7", "border_mode": "valid", "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_10", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "activity_regularizer": null, "activation": "linear", "nb_filter": 8, "W_regularizer": null, "nb_col": 3, "trainable": true, "bias": true, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_8", "border_mode": "valid", "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_11", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_5", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "output_dim": 128, "trainable": true, "b_constraint": null, "input_dim": 5184, "b_regularizer": null, "name": "dense_5"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_12", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_6", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "output_dim": 64, "trainable": true, "b_constraint": null, "input_dim": 128, "b_regularizer": null, "name": "dense_6"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_13", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "output_dim": 32, "trainable": true, "b_constraint": null, "input_dim": 64, "b_regularizer": null, "name": "dense_7"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_14", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "output_dim": 6, "trainable": true, "b_constraint": null, "input_dim": 32, "b_regularizer": null, "name": "dense_8"}}]}