{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "BatchNormalization", "config": {"mode": 0, "axis": -1, "input_dtype": "float32", "batch_input_shape": [null, 45, 80, 1], "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_2", "epsilon": 0.001}}, {"class_name": "Cropping2D", "config": {"trainable": true, "cropping": [[15, 1], [1, 1]], "name": "cropping2d_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "dim_ordering": "tf", "name": "convolution2d_4", "trainable": true, "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "activity_regularizer": null, "nb_row": 3, "b_regularizer": null, "nb_filter": 64, "nb_col": 3, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_4"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "dim_ordering": "tf", "name": "convolution2d_5", "trainable": true, "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "activity_regularizer": null, "nb_row": 3, "b_regularizer": null, "nb_filter": 32, "nb_col": 3, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "dim_ordering": "tf", "name": "convolution2d_6", "trainable": true, "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "activity_regularizer": null, "nb_row": 3, "b_regularizer": null, "nb_filter": 16, "nb_col": 3, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "dim_ordering": "tf", "name": "convolution2d_7", "trainable": true, "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "activity_regularizer": null, "nb_row": 3, "b_regularizer": null, "nb_filter": 8, "nb_col": 3, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "output_dim": 128, "trainable": true, "activation": "linear", "name": "dense_5", "W_constraint": null, "input_dim": 2800, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "output_dim": 64, "trainable": true, "activation": "linear", "name": "dense_6", "W_constraint": null, "input_dim": 128, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "output_dim": 32, "trainable": true, "activation": "linear", "name": "dense_7", "W_constraint": null, "input_dim": 64, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "output_dim": 6, "trainable": true, "activation": "linear", "name": "dense_8", "W_constraint": null, "input_dim": 32, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null}}]}